<a href="https://colab.research.google.com/github/deepeshaburse/winter-of-contributing/blob/Datascience_With_Python/disneyland_review_analysis.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = pd.read_csv("/content/DisneylandReviews.csv", encoding='cp1252', na_values = 'missing')

In [5]:
df.head()

   Review_ID  ...               Branch
0  670772142  ...  Disneyland_HongKong
1  670682799  ...  Disneyland_HongKong
2  670623270  ...  Disneyland_HongKong
3  670607911  ...  Disneyland_HongKong
4  670607296  ...  Disneyland_HongKong

[5 rows x 6 columns]

In [6]:
df.describe()

          Review_ID        Rating
count  4.265600e+04  42656.000000
mean   3.188553e+08      4.217695
std    1.657092e+08      1.063371
min    1.398724e+06      1.000000
25%    1.743274e+08      4.000000
50%    2.907583e+08      5.000000
75%    4.489579e+08      5.000000
max    6.708014e+08      5.000000

In [8]:
df.shape

(42656, 6)

In [9]:
df.isnull().sum()

Review_ID               0
Rating                  0
Year_Month           2613
Reviewer_Location       0
Review_Text             0
Branch                  0
dtype: int64

In [10]:
df.dropna(inplace = True)

In [11]:
df.isnull().sum()

Review_ID            0
Rating               0
Year_Month           0
Reviewer_Location    0
Review_Text          0
Branch               0
dtype: int64

In [12]:
df.Review_ID.nunique()

40023

In [13]:
df.Review_ID.value_counts()

121568004    2
129214104    2
164830205    2
168489234    2
121580686    2
            ..
293917263    1
278053453    1
639814220    1
126558105    1
322889295    1
Name: Review_ID, Length: 40023, dtype: int64

In [14]:
df.drop_duplicates(subset = "Review_ID", inplace = True, keep = "first")

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 40023 entries, 0 to 42117
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Review_ID          40023 non-null  int64
 1   Rating             40023 non-null  int64
 2   Year_Month         40023 non-null  object
 3   Reviewer_Location  40023 non-null  object
 4   Review_Text        40023 non-null  object
 5   Branch             40023 non-null  object
dtypes: int64(2), object(4)
memory usage: 2.1+ MB